cw/app/controllers/client_workouts_controller.rb

  def find
  	@client_workouts = ClientWorkout.find(:all,:conditions=>["client_name = ? or trainer = ?",params[:search_string],params[:search_string]])
---
SELECT * FROM "client_workouts" WHERE (client_name = 'noraidah' or trainer = 'noraidah')

  def index
    @client_workouts = ClientWorkout.all
---
SELECT * FROM "client_workouts"

  def show
    @client_workout = ClientWorkout.find(params[:id])
---
SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 1)

  def edit
    @client_workout = ClientWorkout.find(params[:id])
---
SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 4)

  def create
    @client_workout = ClientWorkout.new(params[:client_workout])

    respond_to do |format|
      if @client_workout.save
---
INSERT INTO "client_workouts" ("updated_at", "client_name", "trainer", "paid_amount", "duration_mins", "date_of_workout", "created_at") VALUES('2009-08-05 04:11:15', 'noraidah', 'akmal', 100.0, 20, '2009-08-05', '2009-08-05 04:11:15')

  def update
    @client_workout = ClientWorkout.find(params[:id])

    respond_to do |format|
      if @client_workout.update_attributes(params[:client_workout])
---
SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 4)
UPDATE "client_workouts" SET "paid_amount" = 33.0, "updated_at" = '2009-08-05 13:53:15' WHERE "id" = 4